# Pandas Series

In [1]:
import pandas as pd

In [2]:
grades= pd.Series([77,100,88])

In [3]:
grades

0     77
1    100
2     88
dtype: int64

In [4]:
pd.Series(89,range(3))

0    89
1    89
2    89
dtype: int64

In [5]:
grades.describe()

count      3.000000
mean      88.333333
std       11.503623
min       77.000000
25%       82.500000
50%       88.000000
75%       94.000000
max      100.000000
dtype: float64

In [6]:
import numpy as np
import pandas as pd
import random

In [ ]:
number = np.random.randint(60,101,40)

In [ ]:
number

In [ ]:
temperature = pd.Series(number)

In [ ]:
print(temperature)

In [ ]:
temperature.min()

In [7]:
temperature.max()

NameError: name 'temperature' is not defined

In [8]:
temperature.describe()

NameError: name 'temperature' is not defined

# DataFrame

In [9]:
grades_dict = {'didi':[89,94,100],'haki':[92,88,75],'ndayi':[97,78,57],'bosco':[88,95,75],'habo':[85,98,73]}

In [10]:
grades_dict

{'didi': [89, 94, 100],
 'haki': [92, 88, 75],
 'ndayi': [97, 78, 57],
 'bosco': [88, 95, 75],
 'habo': [85, 98, 73]}

In [11]:
grade= pd.DataFrame(grades_dict)

In [12]:
grade

   didi  haki  ndayi  bosco  habo
0    89    92     97     88    85
1    94    88     78     95    98
2   100    75     57     75    73

In [13]:
grades_dict1 = {'didi':[89,94,100],'haki':[92,88,75],'ndayi':[97,78,57],'bosco':[88,95,75],'habo':[85,98,'NAN']}

In [14]:
gradess= pd.DataFrame(grades_dict1)

In [15]:
gradess

   didi  haki  ndayi  bosco habo
0    89    92     97     88   85
1    94    88     78     95   98
2   100    75     57     75  NAN

In [16]:
grade.index = ['Test1', 'Test2', 'Test3']

In [17]:
grade

       didi  haki  ndayi  bosco  habo
Test1    89    92     97     88    85
Test2    94    88     78     95    98
Test3   100    75     57     75    73

In [18]:
grade.describe()

             didi       haki      ndayi      bosco       habo
count    3.000000   3.000000   3.000000   3.000000   3.000000
mean    94.333333  85.000000  77.333333  86.000000  85.333333
std      5.507571   8.888194  20.008332  10.148892  12.503333
min     89.000000  75.000000  57.000000  75.000000  73.000000
25%     91.500000  81.500000  67.500000  81.500000  79.000000
50%     94.000000  88.000000  78.000000  88.000000  85.000000
75%     97.000000  90.000000  87.500000  91.500000  91.500000
max    100.000000  92.000000  97.000000  95.000000  98.000000

In [19]:
grade.loc['Test1']

didi     89
haki     92
ndayi    97
bosco    88
habo     85
Name: Test1, dtype: int64

In [20]:
grade.iloc[0][2]

97

In [21]:
grade.iloc[2][2]

57

In [23]:
grade.at['Test1','habo']

85

In [25]:
grade.iat[0,4]

85

In [26]:
grade.describe()

             didi       haki      ndayi      bosco       habo
count    3.000000   3.000000   3.000000   3.000000   3.000000
mean    94.333333  85.000000  77.333333  86.000000  85.333333
std      5.507571   8.888194  20.008332  10.148892  12.503333
min     89.000000  75.000000  57.000000  75.000000  73.000000
25%     91.500000  81.500000  67.500000  81.500000  79.000000
50%     94.000000  88.000000  78.000000  88.000000  85.000000
75%     97.000000  90.000000  87.500000  91.500000  91.500000
max    100.000000  92.000000  97.000000  95.000000  98.000000

In [27]:
pd.set_option('precision',2)

In [28]:
grade.describe()

         didi   haki  ndayi  bosco   habo
count    3.00   3.00   3.00   3.00   3.00
mean    94.33  85.00  77.33  86.00  85.33
std      5.51   8.89  20.01  10.15  12.50
min     89.00  75.00  57.00  75.00  73.00
25%     91.50  81.50  67.50  81.50  79.00
50%     94.00  88.00  78.00  88.00  85.00
75%     97.00  90.00  87.50  91.50  91.50
max    100.00  92.00  97.00  95.00  98.00

In [29]:
grade.T

       Test1  Test2  Test3
didi      89     94    100
haki      92     88     75
ndayi     97     78     57
bosco     88     95     75
habo      85     98     73

In [30]:
grade.T.describe()

       Test1  Test2   Test3
count   5.00   5.00    5.00
mean   90.20  90.60   76.00
std     4.55   7.92   15.39
min    85.00  78.00   57.00
25%    88.00  88.00   73.00
50%    89.00  94.00   75.00
75%    92.00  95.00   75.00
max    97.00  98.00  100.00

# Exercises

In [59]:
temps= {'Mon':[68,89],'Tue':[71,93],'Wed':[66,82],'Thu':[75,97],'Fri':[62,79]}

In [60]:
temperature= pd.DataFrame(temps)

In [61]:
temperature

   Mon  Tue  Wed  Thu  Fri
0   68   71   66   75   62
1   89   93   82   97   79

In [62]:
temperature.index=  ['Low','High']

In [63]:
temperature

      Mon  Tue  Wed  Thu  Fri
Low    68   71   66   75   62
High   89   93   82   97   79

In [64]:
temperature.loc['Low',['Mon','Wed']]

Mon    68
Wed    66
Name: Low, dtype: int64

In [65]:
temperature.loc['Low']

Mon    68
Tue    71
Wed    66
Thu    75
Fri    62
Name: Low, dtype: int64

In [66]:
pd.set_option('precision',2)

In [67]:
temperature.mean()

Mon    78.5
Tue    82.0
Wed    74.0
Thu    86.0
Fri    70.5
dtype: float64

In [72]:
temperature.loc['Low'].mean()

68.4

In [73]:
temperature.loc['High'].mean()

88.0

In [74]:
temperature.mean(axis=1)

Low     68.4
High    88.0
dtype: float64

In [1]:
import pandas as pd

In [2]:
zips= pd.Series({'Boston': '02245','Mamian':'7645'})

In [3]:
zips.str.match(r'\d{5}')

Boston     True
Mamian    False
dtype: bool

In [113]:
contacts= [['Digo Mani','dieudonne@aims.gh','7735644746'],
           ['Haki elia','hakizimana@aims.gh','4867475555']]

In [114]:
Data = pd.DataFrame(contacts,columns=['Name','Email','phonenumber'])

In [115]:
Data

        Name               Email phonenumber
0  Digo Mani   dieudonne@aims.gh  7735644746
1  Haki elia  hakizimana@aims.gh  4867475555

In [116]:
import re

In [117]:
def reformatingphone(value):
    result= re.fullmatch(r'(\d{3})(\d{3})(\d{4})',value)
    return '-'.join(result.groups()) if result else value

In [118]:
formatted_phone= Data['phonenumber'].map(reformatingphone)

In [119]:
formatted_phone

0    773-564-4746
1    486-747-5555
Name: phonenumber, dtype: object

In [120]:
  Data['phonenumber']=formatted_phone

In [121]:
formatted_phone

0    773-564-4746
1    486-747-5555
Name: phonenumber, dtype: object

In [122]:
Data

        Name               Email   phonenumber
0  Digo Mani   dieudonne@aims.gh  773-564-4746
1  Haki elia  hakizimana@aims.gh  486-747-5555

# Exercise

In [135]:
contacts= [['Digo Mani','dieudonne@aims.gh','7635644746'],
           ['Haki elia','hakizimana@aims.gh','7867475555']]

In [136]:
contactsdf= pd.DataFrame(contacts,columns=['Name','Email','Phone'])

In [137]:
contactsdf

        Name               Email       Phone
0  Digo Mani   dieudonne@aims.gh  7635644746
1  Haki elia  hakizimana@aims.gh  7867475555

In [138]:
import re

In [151]:
def get_formatted_phone(value):
    result= re.fullmatch(r'(\d{3})(\d{3})(\d{4})',value) 
    if result:
        part1, part2,part3 = result.groups()
        return '('+ part1 + ') ' + part2 +'-'+part3
    else:
        value

In [152]:
phonenumber_formetted= contactsdf['Phone'].map(get_formatted_phone)

In [153]:
phonenumber_formetted

0    (763) 564-4746
1    (786) 747-5555
Name: Phone, dtype: object

In [154]:
contactsdf['Phone']= phonenumber_formetted

In [155]:
contactsdf

        Name               Email           Phone
0  Digo Mani   dieudonne@aims.gh  (763) 564-4746
1  Haki elia  hakizimana@aims.gh  (786) 747-5555